In [1]:
import pandas as pd

# Concatenation with pd.concat() and df1.append(df2)
Concatenation of Pandas Series and DataFrames with pd.concat() and df.append():

- pd.concat(): To concatenate two or more Pandas objects along a particular axis (default: axis = 0): e.g., concatenate two DataFrames with the same number of rows sorted in the same order for axis = 1:
    - Accepts a list of data frames to combine
    - Uses a single column for each of the repeated (common) columns
     - Preserves index values, by default:
    - This leads to duplicates, or rows with duplicate index values
    - To handle duplicates: (a) throw the ValueError; (b) create new index values; or (c) create a hierarchically indexed Pandas object

- df1.append(df2): Vertical or by-row merging: To append rows of one Pandas DataFrame to the end of the other Pandas DataFrame, returning a new DataFrame.
    - Columns not in the first frame are added as new columns
    - It basically concatenates along axis=0, namely the index
    - It does not modify the original Pandas object but creates a new object with the combined data
     - It is not an efficient method as it creates a new index and data buffer:
    - it is better to use pd.concat() method

# pd.concat()

In [2]:
pd.concat?

## Example - Concatenaate series

In [3]:
s1 = pd.Series(['Jon','Ned'],
              index = [1, 2])

In [5]:
s2 = pd.Series(['bilbo','gandalf'],
              index = [3, 4])

In [7]:
s1

1    Jon
2    Ned
dtype: object

In [8]:
s2

3      bilbo
4    gandalf
dtype: object

#### By row concatenation

In [10]:
pd.concat([s1, s2])

1        Jon
2        Ned
3      bilbo
4    gandalf
dtype: object

#### By column concatenation

In [11]:
pd.concat([s1, s2], axis = 1)

     0        1
1  Jon      NaN
2  Ned      NaN
3  NaN    bilbo
4  NaN  gandalf

# Example- Concatenate DataFrames

In [12]:
idnumber = [1,2,5]
fname = ['A', 'B', 'C']
age = [10,20,30]
grade = ['x','y','z']

In [13]:
df1 = pd.DataFrame({'id':idnumber, 'fname':fname})

In [15]:
df2 = pd.DataFrame({'age':age,'grade':grade})

In [16]:
df3 = pd.DataFrame({'id':[3,4],'fname':['C','D']})

In [17]:
df1

   id fname
0   1     A
1   2     B
2   5     C

In [18]:
df2

   age grade
0   10     x
1   20     y
2   30     z

In [19]:
df3

   id fname
0   3     C
1   4     D

#### Vertical concatenation - By Row

In [21]:
pd.concat([df1, df2])

/home/tushar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    age fname grade   id
0   NaN     A   NaN  1.0
1   NaN     B   NaN  2.0
2   NaN     C   NaN  5.0
0  10.0   NaN     x  NaN
1  20.0   NaN     y  NaN
2  30.0   NaN     z  NaN

#### Horizontal - By column concatenation

In [22]:
pd.concat([df1,df2], axis = 1)

   id fname  age grade
0   1     A   10     x
1   2     B   20     y
2   5     C   30     z

# Duplicate Indices

In [23]:
pd.concat([df1, df2])

/home/tushar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    age fname grade   id
0   NaN     A   NaN  1.0
1   NaN     B   NaN  2.0
2   NaN     C   NaN  5.0
0  10.0   NaN     x  NaN
1  20.0   NaN     y  NaN
2  30.0   NaN     z  NaN

## Handling Duplicate Indices
Notice the repeated indices in the example above. To handle the repeats, pd.concat() offers a few options:

- Catching the repeats as an error: Verify that the indices in the result of pd.concat() do not overlap by setting the hyperparameter verify_integrity = True. In this case, index repeats throw an exception that must be caught.
- Ignoring the index: If the index does not matter, you can simply ignore it by setting the hyperparameter ignore_index = True.
- Adding MultiIndex keys and creating a hierarchically indexed Pandas object using the keys option (outside the scope of this lecture)

#### Catching errors

In [25]:
try:
    pd.concat([df1, df2], 
             verify_integrity = True)
except ValueError as e:
    print('Value Error::', e)

Value Error:: Indexes have overlapping values: Int64Index([0, 1, 2], dtype='int64')

/home/tushar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

#### Ignoring the index

In [27]:
pd.concat([df1, df2], 
         ignore_index = True)

/home/tushar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

    age fname grade   id
0   NaN     A   NaN  1.0
1   NaN     B   NaN  2.0
2   NaN     C   NaN  5.0
3  10.0   NaN     x  NaN
4  20.0   NaN     y  NaN
5  30.0   NaN     z  NaN

# Concatenate DataFrames with Different Columns
For simple concatenation, the two Pandas objects share exactly the same columns. However, in practice, data from different sources may contain different column names. To handle different column names, pd.concat() offers a few options via its join = and join_axis = hyperparameters:

- Intersection of the input columns (join = 'inner')
- Union of the input columns (join = 'outer')
- Specification of which columns to keep (e.g., join_axes = [df2.columns])

In [28]:
idnumber = [1,2,5]
fname = ['A', 'B', 'C']
age = [10,20,30]
grade = ['x','y','z']

In [30]:
df1 = pd.DataFrame({'id':idnumber, 'fname': fname},
                  index = [3,5,7])

In [31]:
df2= pd.DataFrame({'age':age,'grade':grade, 'fname':fname}, index = [3, 6, 9])

In [32]:
df1

   id fname
3   1     A
5   2     B
7   5     C

In [33]:
df2

   age grade fname
3   10     x     A
6   20     y     B
9   30     z     C

#### Intersection join = inner

In [34]:
pd.concat([df1,df2], join = 'inner')

  fname
3     A
5     B
7     C
3     A
6     B
9     C

#### Union join = outer

In [35]:
pd.concat([df1,df2], join = 'outer')

/home/tushar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    age fname grade   id
3   NaN     A   NaN  1.0
5   NaN     B   NaN  2.0
7   NaN     C   NaN  5.0
3  10.0     A     x  NaN
6  20.0     B     y  NaN
9  30.0     C     z  NaN

#### Specifying which columns to keep

In [36]:
pd.concat ([df1, df2], 
           join_axes = [df2.columns])

    age grade fname
3   NaN   NaN     A
5   NaN   NaN     B
7   NaN   NaN     C
3  10.0     x     A
6  20.0     y     B
9  30.0     z     C

# df.append()

In [37]:
df1

   id fname
3   1     A
5   2     B
7   5     C

In [38]:
df3

   id fname
0   3     C
1   4     D

In [39]:
df1.append(df3)

   id fname
3   1     A
5   2     B
7   5     C
0   3     C
1   4     D

# Merge and Join with pd.merge() and/or df1.merge(df2)

high-performance, in-memory join and merge operations for Pandas objects using the pd.merge() function and/or df1.merge(df2) method.

Specifically, we will cover the following types of joins in df1.merge (df2):

- inner joins: looks for common key column names, keeps the values from the intersection of the values in those columns, and then aligns the values in those columns (how='inner')

- outer joins: : looks for common key column names, keeps the values from the union of the values in those columns, and then aligns the values in those columns (how='outer')
- left joins: looks for common key column names, keeps all the values from df1, and then adds and aligns the common values in those columns from df2 (how='left')
- right joins: looks for common key column names, keeps all the values from df2, and then adds and aligns the common values in those columns from df1 (how='right')


- one-to-one joins: column-wise concatenation
- many-to-one: joins in which one of the two key columns contains duplicate entries
- many-to-many: joins with the key columns in both the left and right DataFrames containing duplicates

## Inner Joins with df1.merge (df2)
- Looks for common column names
- Aligns the common values in those columns
- Discards rows with values in the aligned columns that only appear in one data frame
- Keeps along with the remaining columns from both frames if both data frames have values that are the same

In [40]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'AI', 'Law']})
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler        AI
3   Harvey       Law

In [48]:
df2 = pd.DataFrame ({'student':['Ned', 'Rinzler', 'Harvey', "Bilbo"],
                    'graduation_year': [2018, 2017, 2019, 2020]})
df2

   student  graduation_year
0      Ned             2018
1  Rinzler             2017
2   Harvey             2019
3    Bilbo             2020

#### Key common column: 'student'

In [49]:
df_inner = df1.merge(df2, how = 'inner')

In [50]:
df_inner

   student  degree  graduation_year
0    Bilbo  Hobbit             2020
1  Rinzler      AI             2017
2   Harvey     Law             2019

In [51]:
pd.merge(df1, df2, how = 'inner')

   student  degree  graduation_year
0    Bilbo  Hobbit             2020
1  Rinzler      AI             2017
2   Harvey     Law             2019

### Outer Joins with df1.merge (df2)
- Looks for common column names
- Aligns the common values in those columns
- Adds the values from the other columns of both data frames
- Fills with NaN if either data frame has a value in the field to join on

In [52]:
df_outer = df1.merge(df2, how = 'outer')

In [53]:
df_outer

   student    degree  graduation_year
0    Bilbo    Hobbit           2020.0
1      Jon  Assassin              NaN
2  Rinzler        AI           2017.0
3   Harvey       Law           2019.0
4      Ned       NaN           2018.0

In [54]:
pd.merge(df1, df2, how = 'outer')

   student    degree  graduation_year
0    Bilbo    Hobbit           2020.0
1      Jon  Assassin              NaN
2  Rinzler        AI           2017.0
3   Harvey       Law           2019.0
4      Ned       NaN           2018.0

### Left Joins with df1.merge (df2, how = 'left')
- Looks for common column names
- Aligns the common values in those columns
- Keeps only the values from the overlapping columns in the data frame the .merge() method is called on (df1)
- If the other data frame is missing aligned values, NaN is used to fill in their values

In [55]:
df_left = df1.merge(df2, how = 'left')

In [56]:
df_left

   student    degree  graduation_year
0    Bilbo    Hobbit           2020.0
1      Jon  Assassin              NaN
2  Rinzler        AI           2017.0
3   Harvey       Law           2019.0

In [57]:
pd.merge(df1,df2, how = 'left')

   student    degree  graduation_year
0    Bilbo    Hobbit           2020.0
1      Jon  Assassin              NaN
2  Rinzler        AI           2017.0
3   Harvey       Law           2019.0

### Right Joins with df1.merge (df2, how = 'right')
- Looks for common column names
- Aligns the common values in those columns
- Keeps only the values from the overlapping columns in the data frame that is passed in as the first parameter of the .merge() method (df2)
- NaN is used to fill in their values

In [58]:
df_right = df1.merge(df2, how = 'right')

In [59]:
df_right

   student  degree  graduation_year
0    Bilbo  Hobbit             2020
1  Rinzler      AI             2017
2   Harvey     Law             2019
3      Ned     NaN             2018

In [60]:
pd.merge(df1,df2, how = 'right')

   student  degree  graduation_year
0    Bilbo  Hobbit             2020
1  Rinzler      AI             2017
2   Harvey     Law             2019
3      Ned     NaN             2018

# Joins with duplicate entries

## one to one joins
- Consider the situation when the values in the column along which the join operation will be performed are all unique in each of the two DataFrames.

In [61]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'AI', 'Law']})
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler        AI
3   Harvey       Law

In [63]:
df2 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'graduation_year': [2018, 2017, 2019, 2020]})
df2

   student  graduation_year
0    Bilbo             2018
1      Jon             2017
2  Rinzler             2019
3   Harvey             2020

In [64]:
df_merged = pd.merge(df1, df2)

In [65]:
df_merged

   student    degree  graduation_year
0    Bilbo    Hobbit             2018
1      Jon  Assassin             2017
2  Rinzler        AI             2019
3   Harvey       Law             2020

### Many-to-one Joins
Consider the situation when there are duplicate values in the key common column of one of the two DataFrames:

- information is repeated for duplicate entries and
- additional columns from the df with unique values are added

In [67]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'Assassin', 'Law']})
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler  Assassin
3   Harvey       Law

In [68]:
df2 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'graduation_year': [2018, 2017, 2019, 2020]})
df2

   student  graduation_year
0    Bilbo             2018
1      Jon             2017
2  Rinzler             2019
3   Harvey             2020

In [69]:
df_duplicate_degree = pd.merge(df1, df2)

In [70]:
df_duplicate_degree

   student    degree  graduation_year
0    Bilbo    Hobbit             2018
1      Jon  Assassin             2017
2  Rinzler  Assassin             2019
3   Harvey       Law             2020

In [72]:
df_unique_degree = pd.DataFrame ({'advisor':['Frodo', 'Ned', 'Jessica'],
                    'degree': ['Hobbit', 'Assassin', 'Law']})
df_unique_degree

   advisor    degree
0    Frodo    Hobbit
1      Ned  Assassin
2  Jessica       Law

In [73]:
pd.merge(df_duplicate_degree, df_unique_degree)

   student    degree  graduation_year  advisor
0    Bilbo    Hobbit             2018    Frodo
1      Jon  Assassin             2017      Ned
2  Rinzler  Assassin             2019      Ned
3   Harvey       Law             2020  Jessica

### Many-to-many Joins
Consider the situation when there are duplicate values in the key common column in both DataFrames:

- all possible combinations among duplicates from both DataFrames are included

In [74]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'Assassin', 'Law']})
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler  Assassin
3   Harvey       Law

In [75]:
df_2_duplicate_degree = pd.DataFrame ({'skills':['stealing', 'humour',
                                               'gunfu', 'jiu-jistu',
                                               'communication', 'leadership'],
                    'degree': ['Hobbit', 'Hobbit', 
                               'Assassin', 'Assassin',
                               'Law', 'Law']})
df_2_duplicate_degree

          skills    degree
0       stealing    Hobbit
1         humour    Hobbit
2          gunfu  Assassin
3      jiu-jistu  Assassin
4  communication       Law
5     leadership       Law

In [76]:
pd.merge(df1, df_2_duplicate_degree)

   student    degree         skills
0    Bilbo    Hobbit       stealing
1    Bilbo    Hobbit         humour
2      Jon  Assassin          gunfu
3      Jon  Assassin      jiu-jistu
4  Rinzler  Assassin          gunfu
5  Rinzler  Assassin      jiu-jistu
6   Harvey       Law  communication
7   Harvey       Law     leadership

# Joins by Specifying Merge Keys
### The on Keywords
- By default, common column names are the columns with the matching column names between two DataFrames.
- They are used as the key.
- Alternatively, one can specify the column name to be used as the key using the on= parameter that expects a String or a list of column names
- The default option or the option with the specified column to join on only works if both left and right DataFrames have the common column names

In [78]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'Assassin', 'Law']})
df2 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                     'degree': ['Accounting', 'Engineering', 'Programmer', 'Biologist'],
                     'graduation_year': [2018, 2017, 2019, 2020]})

In [79]:
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler  Assassin
3   Harvey       Law

In [80]:
df2

   student       degree  graduation_year
0    Bilbo   Accounting             2018
1      Jon  Engineering             2017
2  Rinzler   Programmer             2019
3   Harvey    Biologist             2020

#### Common columns : student, degree

In [81]:
pd.merge(df1, df2, how = 'outer')

   student       degree  graduation_year
0    Bilbo       Hobbit              NaN
1      Jon     Assassin              NaN
2  Rinzler     Assassin              NaN
3   Harvey          Law              NaN
4    Bilbo   Accounting           2018.0
5      Jon  Engineering           2017.0
6  Rinzler   Programmer           2019.0
7   Harvey    Biologist           2020.0

#### By specific column : student

In [83]:
pd.merge(df1, df2, how = 'outer', on = 'student')

   student  degree_x     degree_y  graduation_year
0    Bilbo    Hobbit   Accounting             2018
1      Jon  Assassin  Engineering             2017
2  Rinzler  Assassin   Programmer             2019
3   Harvey       Law    Biologist             2020

In [84]:
pd.merge(df1, df2, how = 'outer', on = 'degree')

  student_x       degree student_y  graduation_year
0     Bilbo       Hobbit       NaN              NaN
1       Jon     Assassin       NaN              NaN
2   Rinzler     Assassin       NaN              NaN
3    Harvey          Law       NaN              NaN
4       NaN   Accounting     Bilbo           2018.0
5       NaN  Engineering       Jon           2017.0
6       NaN   Programmer   Rinzler           2019.0
7       NaN    Biologist    Harvey           2020.0

###  Joins with Conflicting Values
Suppose you end up with the situation of having common columns between two DataFrames for which the values are conflicting.

- The default behavior for the merge() function is to automatically append a suffix _x or _y to make the column names unique
- If default column names are inappropriate, then the default suffixes could be replaces with the strings specified by the suffixes= parameter

In [85]:
pd.merge(df1, df2, 
         how = 'outer', 
         on = 'student',
         suffixes = ['_L',"_R"])

   student  degree_L     degree_R  graduation_year
0    Bilbo    Hobbit   Accounting             2018
1      Jon  Assassin  Engineering             2017
2  Rinzler  Assassin   Programmer             2019
3   Harvey       Law    Biologist             2020

### The left_on and right_on Keywords
- Suppose you need to merge two datasets with different column names but the same meaning (e.g., 'student' and 'name').
- Use the left_on= and right_on parameters to specify key columns to join on
- The result will have a redundant column(s) that you can remove using the .drop() method

In [89]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'Assassin', 'Law']})
df2 = pd.DataFrame ({'name':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                     'Salary': [1000,2000,1500,3000]})

In [90]:
df1

   student    degree
0    Bilbo    Hobbit
1      Jon  Assassin
2  Rinzler  Assassin
3   Harvey       Law

In [91]:
df2

      name  Salary
0    Bilbo    1000
1      Jon    2000
2  Rinzler    1500
3   Harvey    3000

In [92]:
pd.merge(df1, df2, 
        left_on = "student",
        right_on = "name")

   student    degree     name  Salary
0    Bilbo    Hobbit    Bilbo    1000
1      Jon  Assassin      Jon    2000
2  Rinzler  Assassin  Rinzler    1500
3   Harvey       Law   Harvey    3000

#### Drop redundant columns

In [93]:
pd.merge(df1, df2, 
        left_on = "student",
        right_on = "name").drop('name', axis = 1)

   student    degree  Salary
0    Bilbo    Hobbit    1000
1      Jon  Assassin    2000
2  Rinzler  Assassin    1500
3   Harvey       Law    3000

### The left_index and right_index Keywords
Suppose that rather than merging on a column, you need to merge on an index.
- You can use the index as the key with the left_index=True and right_index=True parameter
- You can mix indices and columns by combining:
- left_index = True with right_on or
- right_index = True with left_on

In [94]:
df1 = pd.DataFrame ({'student':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                    'degree': ['Hobbit', 'Assassin', 'Assassin', 'Law']})
df2 = pd.DataFrame ({'name':['Bilbo', 'Jon', 'Rinzler', 'Harvey'],
                     'Salary': [1000,2000,1500,3000]})

In [96]:
df1_index = df1.set_index('student')
df2_index = df2.set_index('name')

In [97]:
df1_index

           degree
student
Bilbo      Hobbit
Jon      Assassin
Rinzler  Assassin
Harvey        Law

In [98]:
df2_index

         Salary
name
Bilbo      1000
Jon        2000
Rinzler    1500
Harvey     3000

In [99]:
pd.merge(df1_index, df2_index,
        left_index = True, 
        right_index = True)

           degree  Salary
Bilbo      Hobbit    1000
Jon      Assassin    2000
Rinzler  Assassin    1500
Harvey        Law    3000

### Mixing left_index with right_on

In [100]:
pd.merge(df1_index, df2,
        left_index = True,
        right_on = 'name')

     degree     name  Salary
0    Hobbit    Bilbo    1000
1  Assassin      Jon    2000
2  Assassin  Rinzler    1500
3       Law   Harvey    3000

### Mixing left_index with right_on

In [102]:
pd.merge(df1, df2_index,
        right_index = True,
        left_on = 'student')

   student    degree  Salary
0    Bilbo    Hobbit    1000
1      Jon  Assassin    2000
2  Rinzler  Assassin    1500
3   Harvey       Law    3000